In [1]:
import pandas as pd

In [2]:
# Series
data = [1,2,3,4,5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
# Create Series from the dictionaries 
data={
    'a':1,
    'b':2,
    'c':3
}
series = pd.Series(data)
series

a    1
b    2
c    3
dtype: int64

In [4]:
# Add Coulmns for the series
data = [1,2,3]
index_values = ['a','b','c']

series = pd.Series(data,index=index_values)
series

a    1
b    2
c    3
dtype: int64

In [6]:
# Dataframe
data = {
    'Name':['Abu','Thahi'],
    'Age':[20,24],
    'Gender':['Male','Female']
}

df = pd.DataFrame(data)
df

    Name  Age  Gender
0    Abu   20    Male
1  Thahi   24  Female

In [11]:
df.loc[0]

Name       Abu
Age         20
Gender    Male
Name: 0, dtype: object

In [8]:
df.iloc[0]

Name       Abu
Age         20
Gender    Male
Name: 0, dtype: object

In [13]:
# To access the specific Value
df.at[1,'Age'] # 1-> index Value 'Age' column

24

In [14]:
# iat -> It based on the row and column   index
df.iat[0,0]

'Abu'

In [15]:
# Data Manipulation with Dataframes
# Add a New Column
df['Salary'] = [5000,6000]
df

    Name  Age  Gender  Salary
0    Abu   20    Male    5000
1  Thahi   24  Female    6000

In [18]:
#Remove a Column
df.drop(columns=['Salary'],inplace=True)

In [20]:
df['Age']=df['Age']+1

In [21]:
df

    Name  Age  Gender
0    Abu   21    Male
1  Thahi   25  Female

In [23]:
# Read a CSV file
data = pd.read_csv('ocr_lower.csv')

In [24]:
data.head()

   Unnamed: 0   Medicine
0           0   azithral
1           1    ascoril
2           2    allegra
3           3       avil
4           4  allegra-m

In [25]:
data.describe()

          Unnamed: 0
count  152997.000000
mean    76498.000000
std     44166.573905
min         0.000000
25%     38249.000000
50%     76498.000000
75%    114747.000000
max    152996.000000